live/03_control_structures/control_structures.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Control structures</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Control structures"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-18 09:18:07 AST"/>
<meta name="author" content="Heikki Lehvaslaiho"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Control structures</h1>

<p>See: perldoc perlintro
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Conditional statements</a></li>
<li><a href="#sec-2">2 Loops</a>
<ul>
<li><a href="#sec-2-1">2.1 Loops in shorthand</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Subroutines</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Conditional statements</h2>
<div class="outline-text-2" id="text-1">


<p>
General format of the <b>if</b> conditional statement is:
</p>



<pre class="example">if (&lt;some test&gt;) {
    # do
} elsif (&lt;other test&gt;) {
    # do
} elsif (&lt;one more test&gt;) {
    # do
} else { # if nothing else matches
    # do
}
</pre>





<pre class="example">$a = 8;
if ($a &gt;= 4 and $a &lt; 7) {
    print "few\n";
} elsif ($a &gt;= 2 &amp;&amp; $a &lt; 4) {
    print "couple\n";
} elsif ($a == 1 ) {
    print "one\n";
} elsif ( not $a ) { # same as: $a == undef || $s == 0
    print "none\n";
} else {
    print "many\n";
}
</pre>


<pre class="example">
many
</pre>


<p>
Note the use of <b>not</b>.
</p>
<p>
In modern perls (5.10 and later) there is a new function called given()
(see: perldoc -f given) that does same as switch() in many languages.
</p>
<p>
If has clearer syntax than <i>if</i> when comparing many times.
</p>



<pre class="example">use v5.10; # this is how you enable new features
$a = 9;
given( $a ){ # the value is put in $_
    when( [4..6] ) { say "few"   }
    when( [2..3] ) { say "couple"}
    when( [1..1] ) { say "one"   }
    when( not $_ ) { say "none"  }
    default        { say "many"  }
}
</pre>


<pre class="example">
many
</pre>


<p>
More often, you only have two choices and the use of if seems
more natural:
</p>



<pre class="example">use v5.10;
$a = 'think';
if ($a eq 'make') {
   say "making...";
} else {
   say "Skipping making.";
}
</pre>


<pre class="example">
Skipping making.
</pre>


<p>
Perl has an other shorthand for this called ternary conditional
operator, ":?" but you might have to make sure to take care of
operator precedence by using parenthesis liberally.
</p>



<pre class="example">use v5.10; 
# this is a common usage
$n = 2;
printf "I have %d dog%s.\n", $n,
          ($n == 1) ? "" : "s";
# This is better done using normal if:
$a = 'think';
$a eq 'make' ? (say "making...") : (say "Skipping making.");
</pre>


<pre class="example">
I have 2 dogs.
Skipping making.
</pre>



<p>
For printf format, see 'perldoc -f sprintf'.
</p>
<p>
This emphasizes structured approach to complex set of decisions. Perl
makes it possible to use several other approaches.
</p>



<pre class="example">use v5.10;
$a = '';
# leaving an empty code block look strange:
if ($a) {
} else {
   say '$a is empty';
}
# better get rid of it:
if (not $a) {
   say '$a is empty';
}
# more fluently:
unless ($a) {
   say '$a is empty';
}
# even easier to read with the transposed order of elements
say '$a is empty' unless $a;
# note the lack of parenthesis
</pre>


<pre class="example">
$a is empty
$a is empty
$a is empty
$a is empty
</pre>


<p>
The code should be readable, so use the shortest construct possible.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Loops</h2>
<div class="outline-text-2" id="text-2">


<p>
The standard <b>for</b> loop (or <b>foreach</b> ) can be written exactly like in
C:
</p>



<pre class="example">use v5.10;
for ($i = 1;$i&lt;4;$i++) {
    say $i;
}
</pre>


<pre class="example">
1
2
3
</pre>


<p>
Most of the time you do not need all that complexity:
</p>



<pre class="example">use v5.10;
for ( 1 .. 3 ) {
    say $_; # values get assigned to default variable
}
</pre>


<pre class="example">
1
2
3
</pre>


<p>
If you code is dealing with many variables and lists, it is 
better to name the variables
</p>



<pre class="example">use v5.10;
my @countdown = reverse 1 .. 3;
foreach my $count (@countdown ) {
    say $count; 
}
say "Boom!"
</pre>


<pre class="example">
3
2
1
Boom!
</pre>



<p>
The <b>for</b> loop is used to go through elements of arrays and hashes:
</p>



<pre class="example">use v5.10;
my %hash = qw( bread 10 milk 3 butter 1 );
for my $item (sort keys %hash) {
    printf " %-7s # %2s\n",  $item, $hash{$item};
}

</pre>


<pre class="example">
 bread   # 10
 butter  #  1
 milk    #  3
</pre>


<p>
Use printf (perldoc sprintf) only when really needed to align values.
</p>
<p>
if you need to test the variable when you are executing, use the
<b>while</b> loop.
</p>



<pre class="example">use v5.10;
my $a = 3;
while ($a) {
    say $a;
    $a--;
}
</pre>


<pre class="example">
3
2
1
</pre>



<p>
The <b>while</b> loop is also good for working with arrays and hashes. Use
it when you do not know beforehand how long you will be reading. Here
it continues until the array is empty.
</p>



<pre class="example">use v5.10;
my @a = 'a' .. 'g';
while (@a) {
    my $rand = int(rand(10));
    if ($rand &lt;5) {
       say "$rand ", (shift @a);
    } else {
        say "$rand ", (pop @a);
    }
}
</pre>


<pre class="example">
7 g
4 a
9 f
2 b
6 e
4 c
7 d
</pre>



<p>
The logic of the <b>while</b> can be reverse by using the <b>until</b> loop. 
</p>




<pre class="example">use v5.10;
my $done;
$counting_up = 1;
until ($done) {
    say "doing stuff";
    $counting_up++;
    $done = 1 if $counting_up == 3;
}
</pre>


<pre class="example">
doing stuff
doing stuff
</pre>


<p>
Equally well, you can be using a long loop and get out of it using <b>last</b>.
</p>



<pre class="example">use v5.10;
$counting_up = 1;
while (1) {
    say "doing stuff";
    $counting_up++;
    last if $counting_up == 3;
}
</pre>


<pre class="example">
doing stuff
doing stuff
</pre>




</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Loops in shorthand</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">use v5.10;
for (1..10) {
  say $_ if $_ &gt; 5;
}
# alternative way
map {say $_} grep {$_ &gt; 5} 1..10;
my @aa = grep {$_ &gt; 5} 1..10;

</pre>



<pre class="example">6
7
8
9
10
6
7
8
9
10
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Subroutines</h2>
<div class="outline-text-2" id="text-3">


<p>
See 'perldoc perlsub'
</p>
<p>
In addition to conditional statements and loops, subroutines are the
most important way of organizing the flow of programme execution.
</p>
<p>
Subroutines allow you to take a single task and completely separate it from
the rest of the programme. It is a closure so you can use lexically
scoped local variables.
</p>




<pre class="example">use v5.10;
use strict;
use warnings;

sub greet {
    my $greeting = "Hello!";
    say $greeting;
}
greet();
</pre>


<pre class="example">
Hello!
</pre>



<p>
When you pass it arguments and use the return value, you have written
your own function. You should not use other variables than those
declared inside the function.
</p>



<pre class="example">use v5.10;
sub sum1 {
    my ($first, $second) = @_;  # @_ = default array
    my $sum = $first + $second;
    return $sum;
}
say sum1(2,3,4);
</pre>


<pre class="example">
5
</pre>


<p>
Arguments to the subroutine are passed using the <b>default array</b>. Rather
than using it directly, it is better practice to use function <b>shift</b>,
that acts on default array. 
</p>
<p>
The last evaluated statement is returned at the end of the subroutine
execution. This can be visually emphasized by using the <b>return</b> key
word.
</p>



<pre class="example">use v5.10;
sub sum2 {
    my $first = shift;
    my $second = shift;
    my $sum = $first + $second;
}
say sum2(2,3); # parenthesis needed
</pre>


<pre class="example">
5
</pre>


<p>
Unless the subroutine knows how many arguments it can take, you have
to use parenthesis around the arguments of the function call. This is
done by <b>prototypes</b> after the subroutine name.
</p>



<pre class="example">use v5.10;
my $DEBUG = 0;
sub sum3 ($$) {  # exactly two scalars needed
    say "inside sum3" if $DEBUG;
    shift() +  shift(); # parenthesis needed here
}
say sum3 2,3;
say sum3 4,5;
</pre>


<pre class="example">
5
9
</pre>


<p>
By default, arguments defined by their order. If there are many
arguments, some of them optional,  and the order might be difficult to
remember. We can use hash view to the array to give names to arguments.
</p>




<pre class="example">use v5.10;

sub sum4 {
    my %args = @_;
    my $one = $args{one} || 0;
    my $two = $args{two} || 0;
    return $one + $two;
}

say sum4(one =&gt; 2,
         two =&gt; 3);
say sum4(two =&gt; 4);
</pre>


<pre class="example">
5
4
</pre>


<p>
Since arguments are passed as elements of the default array, multiple
arrays are concatenated together, <b>flattened</b>.
</p>



<pre class="example">use v5.10;
my @list1 = qw( 3 5 7);
my @list2 = qw( 9 2 4 5);

sub count_arrays {
    return scalar @_;
}

say count_arrays (@list1, @list2);
</pre>


<pre class="example">
7
</pre>


<p>
How can we pass list arguments without flattening?
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-18 09:18:07 AST</p>
<p class="author">Author: Heikki Lehvaslaiho</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
